code-review/NRB_3471_3546/База_Было/Reports/КонтрольОперацийСОбособленнымиЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КонтрольОперацийСОбособленнымиЦБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КатегорииРолейКлиентовСогласноУказов81и95.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииРолейКлиентовСогласноУказов81и95</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КатегорияРоли</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРолейКлиентовСогласноУказов81и95</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/ЮридическиеЛицаМеждународныеКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЮридическиеЛицаМеждународныеКомпании</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МеждународнаяКомпания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакРегистрацииМеждународнойКомпании</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакРегистрацииМеждународнойКомпании</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КлиентыСУчетомНаСчетахТипаC.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСУчетомНаСчетахТипаC</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФлагАктивности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/InformationRegisters/КлассификаторДляОтчетовВидыСчетовДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КлассификаторДляОтчетовВидыСчетовДЕПО</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидСчетаДляОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСчетаДляОтчетаКлиентаТипаC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипСчета1С</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыРазделовСчетовДЕПО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыРазделовСчетовДЕПО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Основной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновнойВТББанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обеспечения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбеспеченияДержатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоРасчеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоПоАресту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоИное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоЗапретОпераций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоВЗалоге</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленный</Name>
					<Comment>Блокировано (обособл. на основании федеральных законов и нормативно-правовых актов РФ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БлокированоОбособленныйПоПредписаниямБР</Name>
					<Comment>Блокировано (обособл. по предписаниям Банка России)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Налоговый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НИФИ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Documents/ОперацииЦБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ОперацииЦБ</Name>
			<BasedOn>
				<xr:Item>Document.Поручение</xr:Item>
				<xr:Item>Document.ЦБВПути</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиЦБДепозитарийМХ</xr:Item>
				<xr:Item>AccumulationRegister.ЗаблокированныеЦБвВышестоящемДепозитарии</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБМестоРасчетов</xr:Item>
				<xr:Item>AccumulationRegister.УслугиДепозитария</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦБ</xr:Item>
				<xr:Item>AccumulationRegister.ЦБВПути</xr:Item>
				<xr:Item>InformationRegister.СтатусыПоручений</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокировочныйРазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВДепозитарииМХ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИсполненияВМестеРасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСделки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Депонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЦБВПути</v8:Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.иц_СводноеПоручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВстречный</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнициаторВстречный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассОпераций</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КлассыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Комментарий100</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Биржи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоПоручения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиОснования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проверка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыНаDMA</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Референс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнойВвод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоМХПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДепоПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифныйПлан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТарифныеПланы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>9</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОтчетаНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Reports/КонтрольОперацийСОбособленнымиЦБ/Ext/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

// BSLLS:MethodSize-off
// Функция возвращает таблицу значений с данными которые необходимо поместить в отчет
// Параметры:
//	Ошибки - Строка
// Возвращаемое значение:
//	- ТаблицаЗначений
Функция ДанныеДляЗаполнения(Ошибки = "") Экспорт
	ВремяНачалаЗамера = ОценкаПроизводительности.НачатьЗамерВремени();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	// Помните, что как ни удивительно, в справочнике контрагентов ЛОЖЬ реквизите НеРезидент означает, 
	// что это нерезидент по документам и наоборот ИСТИНА - что резидент.
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ОстаткиЦБ.Период, ДЕНЬ) КАК ДатаОперации,
	|	ОстаткиЦБ.Регистратор КАК Регистратор,
	|	ОстаткиЦБ.НомерСтроки КАК НомерСтроки,
	|	ОстаткиЦБ.СчетДепо КАК СчетДепо,
	|	ОстаткиЦБ.РазделСчетаДепо КАК РазделСчетаДепо,
	|	ОстаткиЦБ.ЦБ КАК ЦБ,
	|	ОстаткиЦБ.Количество КАК Количество,
	|	ОстаткиЦБ.ВидДвижения КАК ВидДвижения
	|ПОМЕСТИТЬ ВТ_Операции
	|ИЗ
	|	РегистрНакопления.ОстаткиЦБ КАК ОстаткиЦБ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
	|		ПО ОстаткиЦБ.РазделСчетаДепо = РазделыСчетаДепо.Ссылка
	|ГДЕ
	|	ОстаткиЦБ.Период МЕЖДУ &ПериодНачало И &ПериодКонец
	|	И РазделыСчетаДепо.ТипРазделаСчетаДЕПО В(&ТипыОбособленныхРазделов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.СчетДепо КАК СчетДепо,
	|	ВТ_Операции.ДатаОперации КАК ДатаОперации
	|ПОМЕСТИТЬ ВТ_ДатыОперацийПоСчетамДепо
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Операции.СчетДепо,
	|	ВТ_Операции.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДатыОперацийПоСчетамДепо.СчетДепо КАК СчетДепо
	|ПОМЕСТИТЬ ВТ_СчетаДепо
	|ИЗ
	|	ВТ_ДатыОперацийПоСчетамДепо КАК ВТ_ДатыОперацийПоСчетамДепо
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДатыОперацийПоСчетамДепо.СчетДепо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаДепо.СчетДепо КАК СчетДепо,
	|	СчетаДепо.Владелец КАК Депонент,
	|	Контрагенты.ЮридическиеФизическиеЛица КАК ЮрФизЛицо,
	|	ВЫБОР
	|		КОГДА Контрагенты.Резидент
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НерезидентПоДокументам,
	|	Контрагенты.УправляющаяКомпания КАК УправляющаяКомпания,
	|	Контрагенты.Субброкер КАК Субброкер,
	|	ВЫБОР
	|		КОГДА НЕ ЮридическиеЛица.ИНН ЕСТЬ NULL
	|				И ЮридическиеЛица.ИНН <> """"
	|			ТОГДА ЮридическиеЛица.ИНН
	|		КОГДА НЕ ЮридическиеЛица.TIN ЕСТЬ NULL
	|				И ЮридическиеЛица.TIN <> """"
	|			ТОГДА ЮридическиеЛица.TIN
	|		КОГДА НЕ ФизическиеЛица.ИНН ЕСТЬ NULL
	|				И ФизическиеЛица.ИНН <> """"
	|			ТОГДА ФизическиеЛица.ИНН
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ИНН,
	|	ВЫБОР
	|		КОГДА НЕ ЮридическиеЛица.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоЮЛ,
	|	ВЫБОР
	|		КОГДА НЕ ФизическиеЛица.Ссылка ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоФЛ
	|ПОМЕСТИТЬ ВТ_Депоненты
	|ИЗ
	|	ВТ_СчетаДепо КАК ВТ_СчетаДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ВТ_СчетаДепо.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО (СчетаДепо.Владелец = Контрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ФизическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮридическиеЛица
	|		ПО (Контрагенты.ЮридическиеФизическиеЛица = ЮридическиеЛица.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Депоненты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации КАК ДатаОперации,
	|	МАКСИМУМ(КатегорииРолейКлиентовСогласноУказов81и95.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодКатегорииПоДатеОперации
	|ИЗ
	|	ВТ_ДатыОперацийПоСчетамДепо КАК ВТ_ДатыОперацийПоСчетамДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Депоненты КАК ВТ_Депоненты
	|		ПО ВТ_ДатыОперацийПоСчетамДепо.СчетДепо = ВТ_Депоненты.СчетДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95 КАК КатегорииРолейКлиентовСогласноУказов81и95
	|		ПО (ВТ_Депоненты.ЮрФизЛицо = КатегорииРолейКлиентовСогласноУказов81и95.ЮрФизЛицо)
	|			И (КатегорииРолейКлиентовСогласноУказов81и95.Период <= ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Депоненты.ЮрФизЛицо,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодКатегорииПоДатеОперации.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ВТ_ПериодКатегорииПоДатеОперации.ДатаОперации КАК ДатаОперации,
	|	КатегорииРолейКлиентовСогласноУказов81и95.КатегорияРоли.Код КАК КатегорияРоли
	|ПОМЕСТИТЬ ВТ_КатегорииРолейКлиентовНаДатыОпераций
	|ИЗ
	|	ВТ_ПериодКатегорииПоДатеОперации КАК ВТ_ПериодКатегорииПоДатеОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КатегорииРолейКлиентовСогласноУказов81и95 КАК КатегорииРолейКлиентовСогласноУказов81и95
	|		ПО ВТ_ПериодКатегорииПоДатеОперации.ЮрФизЛицо = КатегорииРолейКлиентовСогласноУказов81и95.ЮрФизЛицо
	|			И ВТ_ПериодКатегорииПоДатеОперации.Период = КатегорииРолейКлиентовСогласноУказов81и95.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Депоненты.ЮрФизЛицо КАК ЮрЛицо,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации КАК ДатаОперации,
	|	МАКСИМУМ(ЮридическиеЛицаМеждународныеКомпании.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодМКПоДатеОперации
	|ИЗ
	|	ВТ_ДатыОперацийПоСчетамДепо КАК ВТ_ДатыОперацийПоСчетамДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Депоненты КАК ВТ_Депоненты
	|		ПО ВТ_ДатыОперацийПоСчетамДепо.СчетДепо = ВТ_Депоненты.СчетДепо
	|			И (ВТ_Депоненты.ЭтоЮЛ)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|		ПО (ВТ_Депоненты.ЮрФизЛицо = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо)
	|			И (ЮридическиеЛицаМеждународныеКомпании.Период <= ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Депоненты.ЮрФизЛицо,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодМКПоДатеОперации.ЮрЛицо КАК ЮрЛицо,
	|	ВТ_ПериодМКПоДатеОперации.ДатаОперации КАК ДатаОперации,
	|	ЮридическиеЛицаМеждународныеКомпании.МеждународнаяКомпания КАК ЭтоМК
	|ПОМЕСТИТЬ ВТ_МеждународныеКомпанииНаДатыОпераций
	|ИЗ
	|	ВТ_ПериодМКПоДатеОперации КАК ВТ_ПериодМКПоДатеОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЮридическиеЛицаМеждународныеКомпании КАК ЮридическиеЛицаМеждународныеКомпании
	|		ПО ВТ_ПериодМКПоДатеОперации.ЮрЛицо = ЮридическиеЛицаМеждународныеКомпании.ЮридическоеЛицо
	|			И ВТ_ПериодМКПоДатеОперации.Период = ЮридическиеЛицаМеждународныеКомпании.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Депоненты.Депонент КАК Клиент,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации КАК ДатаОперации,
	|	МАКСИМУМ(КлиентыСУчетомНаСчетахТипаC.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ПериодПоДатеОперацииДляСчетовТипаC
	|ИЗ
	|	ВТ_ДатыОперацийПоСчетамДепо КАК ВТ_ДатыОперацийПоСчетамДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Депоненты КАК ВТ_Депоненты
	|		ПО ВТ_ДатыОперацийПоСчетамДепо.СчетДепо = ВТ_Депоненты.СчетДепо
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСУчетомНаСчетахТипаC КАК КлиентыСУчетомНаСчетахТипаC
	|		ПО (ВТ_Депоненты.Депонент = КлиентыСУчетомНаСчетахТипаC.Клиент)
	|			И (КлиентыСУчетомНаСчетахТипаC.Период <= ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Депоненты.Депонент,
	|	ВТ_ДатыОперацийПоСчетамДепо.ДатаОперации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодПоДатеОперацииДляСчетовТипаC.Клиент КАК Клиент,
	|	ВТ_ПериодПоДатеОперацииДляСчетовТипаC.ДатаОперации КАК ДатаОперации,
	|	КлиентыСУчетомНаСчетахТипаC.ФлагАктивности КАК ИмеетСчетаТипаC
	|ПОМЕСТИТЬ ВТ_СчетаТипаC
	|ИЗ
	|	ВТ_ПериодПоДатеОперацииДляСчетовТипаC КАК ВТ_ПериодПоДатеОперацииДляСчетовТипаC
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыСУчетомНаСчетахТипаC КАК КлиентыСУчетомНаСчетахТипаC
	|		ПО ВТ_ПериодПоДатеОперацииДляСчетовТипаC.Клиент = КлиентыСУчетомНаСчетахТипаC.Клиент
	|			И ВТ_ПериодПоДатеОперацииДляСчетовТипаC.Период = КлиентыСУчетомНаСчетахТипаC.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КлассификаторДляОтчетовВидыСчетовДЕПОСрезПоследних.ТипСчета1С КАК ТипСчета1С,
	|	КлассификаторДляОтчетовВидыСчетовДЕПОСрезПоследних.ВидСчетаДляОтчета КАК ВидСчетаДляОтчета,
	|	КлассификаторДляОтчетовВидыСчетовДЕПОСрезПоследних.ВидСчетаДляОтчетаКлиентаТипаC КАК ВидСчетаДляОтчетаКлиентаТипаC
	|ПОМЕСТИТЬ ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО
	|ИЗ
	|	РегистрСведений.КлассификаторДляОтчетовВидыСчетовДЕПО.СрезПоследних(&ПериодКонец, 1 = 1) КАК КлассификаторДляОтчетовВидыСчетовДЕПОСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.Регистратор КАК Регистратор
	|ПОМЕСТИТЬ ВТ_Регистраторы
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Операции.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОрганизацияПоУмолчанию.Значение КАК Организация,
	|	Организации.Наименование КАК Наименование,
	|	Организации.ИНН КАК ИНН
	|ПОМЕСТИТЬ ВТ_ОрганизацияПоУмолчанию
	|ИЗ
	|	Константа.ОрганизацияПоУмолчанию КАК ОрганизацияПоУмолчанию
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ОрганизацияПоУмолчанию.Значение = Организации.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Операции.Регистратор КАК Регистратор,
	|	ВТ_Операции.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ОперацииЦБ.ВидОперацииД, ГлобальнаяОперация.ВидГлобальнойОперации) КАК ВидОперации,
	|	Поручение.ОснованиеОперацииДКУ КАК ПоручениеОснованиеОперацииДКУ,
	|	Поручение.ТипСвертки КАК ПоручениеТипСвертки,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|						И ОперацииЦБ.ВидОперацииД <> ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|					ИЛИ ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСписание,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И ОперацииЦБ.ВидОперацииД <> ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|				И Поручение.ТипСвертки = ЗНАЧЕНИЕ(Перечисление.ТипыСверток.ПоСделке)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоПередачаЦБ_КОПоУказу138,
	|	ОперацииЦБКонтрагенты.ЮридическиеФизическиеЛица КАК КонтрагентЛицо,
	|	ЕСТЬNULL(КонтрагентыЮридическиеЛица.Наименование, КонтрагентыФизическиеЛица.Наименование) КАК КонтрагентЛицоНаименование,
	|	ЕСТЬNULL(КонтрагентыЮридическиеЛица.ИНН, КонтрагентыФизическиеЛица.ИНН) КАК КонтрагентЛицоИНН,
	|	ЕСТЬNULL(КонтрагентыЮридическиеЛица.TIN, """") КАК КонтрагентЮрЛицоTIN
	|ПОМЕСТИТЬ ВТ_ДанныеРегистраторов
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацииЦБ КАК ОперацииЦБ
	|		ПО ВТ_Операции.Регистратор = ОперацииЦБ.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ГлобальнаяОперация КАК ГлобальнаяОперация
	|		ПО ВТ_Операции.Регистратор = ГлобальнаяОперация.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОрганизацияПоУмолчанию КАК ВТ_ОрганизацияПоУмолчанию
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Поручение КАК Поручение
	|		ПО (ОперацииЦБ.ДокументОснование = Поручение.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК ОперацииЦБКонтрагенты
	|		ПО (ОперацииЦБ.Контрагент = ОперацииЦБКонтрагенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК КонтрагентыЮридическиеЛица
	|		ПО (ОперацииЦБКонтрагенты.ЮридическиеФизическиеЛица = КонтрагентыЮридическиеЛица.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК КонтрагентыФизическиеЛица
	|		ПО (ОперацииЦБКонтрагенты.ЮридическиеФизическиеЛица = КонтрагентыФизическиеЛица.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ОрганизацияПоУмолчанию.Наименование КАК НаименованиеОрганизации,
	|	ВТ_ОрганизацияПоУмолчанию.ИНН КАК ИННОрганизации,
	|	ВТ_Операции.ДатаОперации КАК ДатаОперации,
	|	ВТ_Операции.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА СправочникЦенныеБумаги.ISIN <> """"
	|			ТОГДА СправочникЦенныеБумаги.ISIN
	|		ИНАЧЕ СправочникЦенныеБумаги.НомерРегистрации
	|	КОНЕЦ КАК ISIN_Или_РегНом,
	|	ВТ_Операции.ЦБ КАК ЦеннаяБумага,
	|	ВТ_Депоненты.ЮрФизЛицо КАК ЮрФизЛицо,
	|	ВТ_Операции.СчетДепо КАК СчетДепо,
	|	ВЫБОР
	|		КОГДА ВТ_Депоненты.ЭтоФЛ
	|				И ВТ_КатегорииРолейКлиентов.КатегорияРоли = 1
	|			ТОГДА ""ФЛН1""
	|		КОГДА ВТ_Депоненты.ЭтоФЛ
	|				И ВТ_КатегорииРолейКлиентов.КатегорияРоли = 2
	|			ТОГДА ""ФЛН2""
	|		КОГДА ВТ_Депоненты.ЭтоФЛ
	|				И ВТ_КатегорииРолейКлиентов.КатегорияРоли = 6
	|			ТОГДА ""ФЛР""
	|		КОГДА НЕ ВТ_Депоненты.НерезидентПоДокументам
	|				И (ВТ_Депоненты.УправляющаяКомпания
	|					ИЛИ ВТ_Депоненты.Субброкер)
	|			ТОГДА ""ПУРЦБ""
	|		КОГДА ВТ_КатегорииРолейКлиентов.КатегорияРоли = 3
	|			ТОГДА ""КИК""
	|		КОГДА ВТ_МеждународныеКомпанииНаДатыОпераций.ЭтоМК
	|			ТОГДА ""МК""
	|		КОГДА ВТ_Депоненты.ЭтоЮЛ
	|				И (ВТ_КатегорииРолейКлиентов.КатегорияРоли = 4
	|					ИЛИ ВТ_КатегорииРолейКлиентов.КатегорияРоли = 5
	|					ИЛИ ВТ_КатегорииРолейКлиентов.КатегорияРоли = 6)
	|			ТОГДА ""ЮЛР""
	|		КОГДА ВТ_Депоненты.ЭтоЮЛ
	|				И ВТ_КатегорииРолейКлиентов.КатегорияРоли = 1
	|			ТОГДА ""ЮЛН1""
	|		КОГДА ВТ_Депоненты.ЭтоЮЛ
	|				И ВТ_КатегорииРолейКлиентов.КатегорияРоли = 2
	|			ТОГДА ""ЮЛН2""
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КатегорияДепонента,
	|	ВТ_КатегорииРолейКлиентов.КатегорияРоли КАК КатегорияРоли,
	|	ВТ_Депоненты.ИНН КАК ИдентификаторДепонента,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_СчетаТипаC.ИмеетСчетаТипаC, ЛОЖЬ)
	|			ТОГДА ЕСТЬNULL(ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО.ВидСчетаДляОтчетаКлиентаТипаC, """")
	|		ИНАЧЕ ЕСТЬNULL(ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО.ВидСчетаДляОтчета, """")
	|	КОНЕЦ КАК ВидСчетаДепо,
	|	""NTD"" КАК КатегорияСчетаДепо,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И (ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|						И ВТ_ДанныеРегистраторов.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|					ИЛИ ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация)
	|			ТОГДА ""Зачисление""
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И (ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|						И ВТ_ДанныеРегистраторов.ВидОперации <> ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|					ИЛИ ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация)
	|			ТОГДА ""Списание""
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|				И ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ""Списание (перевод)""
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				И ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод)
	|			ТОГДА ""Зачисление (перевод)""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ТипОперации,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ВТ_Операции.Количество
	|		ИНАЧЕ -1 * ВТ_Операции.Количество
	|	КОНЕЦ КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистраторов.ЭтоСписание
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_ДанныеРегистраторов.ПоручениеОснованиеОперацииДКУ = ЗНАЧЕНИЕ(Справочник.КодыОснованияОперацийДКУ.TR01)
	|						ТОГДА ""Перевод ценных бумаг без перехода прав собственности в другой депозитарий""
	|					КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|							И ВТ_ДанныеРегистраторов.ПоручениеТипСвертки = ЗНАЧЕНИЕ(Перечисление.ТипыСверток.ПоСделке)
	|						ТОГДА ""Передача ценных бумаг КО в соответствии с п. 10 Указа № 138""
	|					КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|							И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Конвертация)
	|								ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение)
	|									И ВидыЦББанкаРоссии.Код <> ""SHS8"")
	|						ТОГДА ""Конвертация, выкуп, погашение ценных бумаг их эмитентом""
	|					КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|							И ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Погашение)
	|							И ВидыЦББанкаРоссии.Код = ""SHS8""
	|						ТОГДА ""Погашение инвестиционных паев ПИФ по решению УК и (или) в связи с прекращением фонда""
	|					КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|							И ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СписаниеАкцийПриЛиквидацииЭмитента)
	|						ТОГДА ""Ликвидация эмитента""
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПричиныСписания,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистраторов.ЭтоПередачаЦБ_КОПоУказу138
	|			ТОГДА ЕСТЬNULL(ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НаименованиеКредитнойОрганизации,
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеРегистраторов.ЭтоПередачаЦБ_КОПоУказу138
	|			ТОГДА ЕСТЬNULL(ВТ_ДанныеРегистраторов.КонтрагентЛицоИНН, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННКредитнойОрганизации,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования))
	|				И НЕ ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование ЕСТЬ NULL
	|				И ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование <> """"
	|			ТОГДА ВТ_ДанныеРегистраторов.КонтрагентЛицо
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перемещение)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод))
	|			ТОГДА ВТ_ОрганизацияПоУмолчанию.Организация
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|			ТОГДА ЮрЛицаЭмитенты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования))
	|				И НЕ ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование ЕСТЬ NULL
	|				И ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование <> """"
	|			ТОГДА ВТ_ДанныеРегистраторов.КонтрагентЛицоНаименование
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перемещение)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод))
	|			ТОГДА ВТ_ОрганизацияПоУмолчанию.Наименование
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				И НЕ ЮрЛицаЭмитенты.Наименование ЕСТЬ NULL
	|				И ЮрЛицаЭмитенты.Наименование <> """"
	|			ТОГДА ЕСТЬNULL(ЮрЛицаЭмитенты.Наименование, ""-"")
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК НаименованиеКонтрагента,
	|	ВЫБОР
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования))
	|				И НЕ ВТ_ДанныеРегистраторов.КонтрагентЛицоИНН ЕСТЬ NULL
	|				И ВТ_ДанныеРегистраторов.КонтрагентЛицоИНН <> """"
	|			ТОГДА ВТ_ДанныеРегистраторов.КонтрагентЛицоИНН
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Депонирование)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.СнятиеСДепонирования))
	|				И НЕ ВТ_ДанныеРегистраторов.КонтрагентЮрЛицоTIN ЕСТЬ NULL
	|				И ВТ_ДанныеРегистраторов.КонтрагентЮрЛицоTIN <> """"
	|			ТОГДА ВТ_ДанныеРегистраторов.КонтрагентЮрЛицоTIN
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ОперацииЦБ
	|				И (ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перемещение)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.ПереводМеждуРазделамиСчетаДепо)
	|					ИЛИ ВТ_ДанныеРегистраторов.ВидОперации = ЗНАЧЕНИЕ(Справочник.ВидыОпераций.Перевод))
	|			ТОГДА ВТ_ОрганизацияПоУмолчанию.ИНН
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				И НЕ ЮрЛицаЭмитенты.ИНН ЕСТЬ NULL
	|				И ЮрЛицаЭмитенты.ИНН <> """"
	|			ТОГДА ЮрЛицаЭмитенты.ИНН
	|		КОГДА ВТ_Операции.Регистратор ССЫЛКА Документ.ГлобальнаяОперация
	|				И НЕ ЮрЛицаЭмитенты.TIN ЕСТЬ NULL
	|				И ЮрЛицаЭмитенты.TIN <> """"
	|			ТОГДА ЮрЛицаЭмитенты.TIN
	|		ИНАЧЕ ""-""
	|	КОНЕЦ КАК ИННКонтрагента
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОрганизацияПоУмолчанию КАК ВТ_ОрганизацияПоУмолчанию
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦенныеБумаги КАК СправочникЦенныеБумаги
	|		ПО ВТ_Операции.ЦБ = СправочникЦенныеБумаги.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВидыЦББанкаРоссии КАК ВидыЦББанкаРоссии
	|		ПО (СправочникЦенныеБумаги.ВидЦББанкаРоссии = ВидыЦББанкаРоссии.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Депоненты КАК ВТ_Депоненты
	|		ПО ВТ_Операции.СчетДепо = ВТ_Депоненты.СчетДепо
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КатегорииРолейКлиентовНаДатыОпераций КАК ВТ_КатегорииРолейКлиентов
	|		ПО (ВТ_Депоненты.ЮрФизЛицо = ВТ_КатегорииРолейКлиентов.ЮрФизЛицо)
	|			И ВТ_Операции.ДатаОперации = ВТ_КатегорииРолейКлиентов.ДатаОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МеждународныеКомпанииНаДатыОпераций КАК ВТ_МеждународныеКомпанииНаДатыОпераций
	|		ПО (ВТ_Депоненты.ЮрФизЛицо = ВТ_МеждународныеКомпанииНаДатыОпераций.ЮрЛицо)
	|			И ВТ_Операции.ДатаОперации = ВТ_МеждународныеКомпанииНаДатыОпераций.ДатаОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СчетаТипаC КАК ВТ_СчетаТипаC
	|		ПО (ВТ_Депоненты.Депонент = ВТ_СчетаТипаC.Клиент)
	|			И ВТ_Операции.ДатаОперации = ВТ_СчетаТипаC.ДатаОперации
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СчетаДепо КАК СчетаДепо
	|		ПО ВТ_Операции.СчетДепо = СчетаДепо.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО КАК ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО
	|		ПО (ВТ_КлассификаторДляОтчетовВидыСчетовДЕПО.ТипСчета1С = СчетаДепо.ТипСчетаДепо)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеРегистраторов КАК ВТ_ДанныеРегистраторов
	|		ПО ВТ_Операции.Регистратор = ВТ_ДанныеРегистраторов.Регистратор
	|			И ВТ_Операции.НомерСтроки = ВТ_ДанныеРегистраторов.НомерСтроки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК КонтрагентыЭмитенты
	|		ПО (СправочникЦенныеБумаги.Эмитент = КонтрагентыЭмитенты.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЮридическиеЛица КАК ЮрЛицаЭмитенты
	|		ПО (КонтрагентыЭмитенты.ЮридическиеФизическиеЛица = ЮрЛицаЭмитенты.Ссылка)";
	Запрос.УстановитьПараметр("ПериодНачало", ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", КонецДня(ПериодКонец));
	ТипыОбособленныхРазделов = Новый Массив;
	ТипыОбособленныхРазделов.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленный);
	ТипыОбособленныхРазделов.Добавить(Перечисления.ТипыРазделовСчетовДЕПО.БлокированоОбособленныйПоПредписаниямБР);
	Запрос.УстановитьПараметр("ТипыОбособленныхРазделов", ТипыОбособленныхРазделов);
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	ПроверитьДанные(ТаблицаДанных, Ошибки);
	ОценкаПроизводительности.ЗакончитьЗамерВремени("КонтрольОперацийСОбособленнымиЦБ.ПолучениеДанныхДляОтчета", ВремяНачалаЗамера);
	
	Возврат ТаблицаДанных; 
КонецФункции
// BSLLS:MethodSize-on

// Процедура заполняет табличный документ на основании данных для заполнения отчета
// Параметры:
//  ТабДок - ТабличныйДокумент
//  ДанныеДляЗаполнения - ТаблицаЗначений
Процедура ЗаполнитьОтчет(ТабДок, ДанныеДляЗаполнения) Экспорт
	ТабДок.Очистить();
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаОтчета = Макет.ПолучитьОбласть("ОбластьСтрокаОтчета");
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого СтрокаДанных Из ДанныеДляЗаполнения Цикл
		ОбластьСтрокаОтчета.Параметры.Заполнить(СтрокаДанных);
		ТабДок.Вывести(ОбластьСтрокаОтчета);
	КонецЦикла;
	ТабДок.Вывести(ОбластьПодвал);
	
	ТабДок.ФиксацияСверху = 4;
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДанные(ТаблицаДанных, Ошибки)
	НомерСтроки = 0;
	Для Каждого СтрокаТЗ Из ТаблицаДанных Цикл
		НомерСтроки = НомерСтроки + 1;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.КатегорияДепонента) Тогда
			ОписаниеОшибки = "Не заполнена категория депонента в 5-й колонке";
			Если СтрокаТЗ.КатегорияРоли = Null Тогда
				ОписаниеОшибки = ОписаниеОшибки
								+ " (вероятная причина - для лица депонента не указана категория роли клиента согласно Указов №81 и №95)";
			КонецЕсли;
			ДобавитьВОшибки(Ошибки, ОписаниеОшибки, НомерСтроки, СтрокаТЗ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ВидСчетаДепо) Тогда
			ОписаниеОшибки = "Не заполнен Вид счета Депо в 7-й колонке";
			ДобавитьВОшибки(Ошибки, ОписаниеОшибки, НомерСтроки, СтрокаТЗ);
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЗ.ТипОперации) Тогда
			ОписаниеОшибки = "Не заполнен Тип операции в 9-й колонке";
			ДобавитьВОшибки(Ошибки, ОписаниеОшибки, НомерСтроки, СтрокаТЗ);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ДобавитьВОшибки(Ошибки, ОписаниеОшибки, НомерСтроки, Данные)
	ИдентификаторСтроки = "строка " + Строка(НомерСтроки) + " депонент " + Строка(Данные.ЮрФизЛицо) 
							+ " (идентификатор:" + Данные.ИдентификаторДепонента + ") за "
							+ Формат(Данные.ДатаОперации, "ДФ=""дд.ММ.гггг""");
	ОписаниеОшибки = ОписаниеОшибки + ", " + ИдентификаторСтроки;
	СтроковыеФункцииКлиентСервер.ДополнитьТекстСтрокой(Ошибки, ОписаниеОшибки);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки);
КонецПроцедуры

#КонецОбласти


#Область Инициализация

ОбщегоНазначения.ЛогироватьИспользованиеОбъекта(ЭтотОбъект);

#КонецОбласти
